using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
// Легковес — это структурный паттерн проектирования, который позволяет вместить бóльшее количество объектов в отведённую оперативную память. Легковес экономит память, разделяя общее состояние объектов
// между собой, вместо хранения одинаковых данных в каждом объекте.
// Например объект частица.Она имеет изменяемы во времени: вектор, скорость, координаты. При этом цвет, sprite у неё бует всегда одинаковый, вне зависимости от времени.
// Решение
// Создаем контект в котором эта частица используется и в контексте прописываем цвет чатицы, вес.
namespace FlyWeight
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
